Autodesk.Revit.DB.Visual.AdvancedTransparent.SurfaceNdfType
The property labeled "NDF" from the "PrismTransparent" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "SurfaceNdfType".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedTransparent.SurfaceRoughness
The property labeled "Roughness" from the "PrismTransparent" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedTransparent.SurfaceRotation
The property labeled "Rotation" from the "PrismTransparent" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedTransparent.SurfaceCutout
The property labeled "Image" from the "PrismTransparent" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedTransparent.SurfaceNormal
The property labeled "Image" from the "PrismTransparent" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedTransparent.SurfaceAnisotropy
The property labeled "Anisotropy" from the "PrismTransparent" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedTransparent.SurfaceAlbedo
The property labeled "Color" from the "PrismTransparent" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedTransparent.TransparentIor
The property labeled "IOR" from the "PrismTransparent" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedTransparent.TransparentDistance
The property labeled "Transparent Distance" from the "PrismTransparent" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedTransparent.TransparentColor
The property labeled "Color" from the "PrismTransparent" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedTransparent
Represents the properties of materials.
Since:
2018.1